---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalEquipment.IsSwitchboard
source: html/6a63aa0e-71a0-ee05-65c8-c49479b14305.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalEquipment.IsSwitchboard Property

The electrical equipment is a switchboard or not.
 This property returns true if the electrical equipment is a switchboard.

## Syntax (C#)
```csharp
public bool IsSwitchboard { get; }
```